perf/enduranceTesting/ping.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api/ping'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warm Up
      duration: 30
      arrivalRate: 15
    - name: Loaded
      duration: 300
      arrivalRate: 500
    - name: Cool Down
      duration: 30
      arrivalRate: 10

scenarios:
  - name: EndPing (/)
    flow:
      - get:
          url: '/'